tutorials/multiphase/interFoam/laminar/wave/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

option1
{
    type            verticalDamping;

    selectionMode   all;

    origin          (1200 0 0);
    direction       (1 0 0);
    ramp
    {
        type        halfCosineRamp;
        start       0;
        duration    600;
    }

    lambda          0.5;

    timeStart       0;
    duration        1e6;
}


//************************************************************************* //
